lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/RA4M1.cpp
/*
 * Platform_RA4M1.cpp
 * Copyright (C) 2024 Linar Yusupov
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#if defined(ARDUINO_ARCH_RENESAS)

#include <SPI.h>
#include <Wire.h>

#include "../system/SoC.h"
#include "../driver/RF.h"
#include "../driver/EEPROM.h"
#include "../driver/LED.h"
#include "../driver/OLED.h"
#include "../driver/Baro.h"
#include "../driver/Sound.h"
#include "../driver/Battery.h"
#include "../driver/Bluetooth.h"
#include "../protocol/data/NMEA.h"
#include "../protocol/data/GDL90.h"
#include "../protocol/data/D1090.h"

#include <WDT.h>
#include <r_lpm.h>

#if !defined(ARDUINO_ARCH_RENESAS_UNO)
#error "ARDUINO UNO is the only one supported at this time"
#endif

// SX127x pin mapping
lmic_pinmap lmic_pins = {
    .nss = SOC_GPIO_PIN_SS,
    .txe = LMIC_UNUSED_PIN,
    .rxe = LMIC_UNUSED_PIN,
    .rst = SOC_GPIO_PIN_RST,
    .dio = {LMIC_UNUSED_PIN, LMIC_UNUSED_PIN, LMIC_UNUSED_PIN},
    .busy = LMIC_UNUSED_PIN,
    .tcxo = LMIC_UNUSED_PIN,
};

#if !defined(EXCLUDE_LED_RING)
// Parameter 1 = number of pixels in strip
// Parameter 2 = Arduino pin number (most are valid)
// Parameter 3 = pixel type flags, add together as needed:
//   NEO_KHZ800  800 KHz bitstream (most NeoPixel products w/WS2812 LEDs)
//   NEO_KHZ400  400 KHz (classic 'v1' (not v2) FLORA pixels, WS2811 drivers)
//   NEO_GRB     Pixels are wired for GRB bitstream (most NeoPixel products)
//   NEO_RGB     Pixels are wired for RGB bitstream (v1 FLORA pixels, not v2)
Adafruit_NeoPixel strip = Adafruit_NeoPixel(PIX_NUM, SOC_GPIO_PIN_LED,
                              NEO_GRB + NEO_KHZ800);
#endif /* EXCLUDE_LED_RING */

#if defined(EXCLUDE_WIFI)
char UDPpacketBuffer[4]; // Dummy definition to satisfy build sequence
#else
#include "../driver/WiFi.h"
#endif /* EXCLUDE_WIFI */

static struct rst_info reset_info = {
  .reason = REASON_DEFAULT_RST,
};

static uint32_t bootCount __attribute__ ((section (".noinit")));
static bool wdt_is_active = false;

const char *RA4M1_Device_Manufacturer = SOFTRF_IDENT;
const char *RA4M1_Device_Model = "Academy Edition";
const uint16_t RA4M1_Device_Version = SOFTRF_USB_FW_VERSION;

#if defined(ARDUINO_UNOR4_WIFI) && (__GNUC__ <= 7)
#include "ArduinoGraphics.h"
#include "Arduino_LED_Matrix.h"

ArduinoLEDMatrix matrix;
#endif /* ARDUINO_UNOR4_WIFI */

#if defined(USE_SOFTSPI)
#include <SoftSPI.h>
SoftSPI RadioSPI(SOC_GPIO_PIN_MOSI,SOC_GPIO_PIN_MISO, SOC_GPIO_PIN_SCK);
#endif /* USE_SOFTSPI */

#if defined(ARDUINO_UNOR4_WIFI) && defined(NO_USB)
void __maybe_start_usb() {
#if defined(USE_RA4M1_USB)
  __USBStart();
#endif
}
#endif /* ARDUINO_UNOR4_WIFI */

static void RA4M1_setup()
{
  if (1U == R_SYSTEM->RSTSR0_b.PORF) /* Power on Reset */
  {
      reset_info.reason = REASON_DEFAULT_RST;
  }
  else if (1U == R_SYSTEM->RSTSR1_b.IWDTRF) /* Independent WDT Reset */
  {
      reset_info.reason = REASON_WDT_RST;
  }
  else if (1U == R_SYSTEM->RSTSR1_b.WDTRF) /* Watchdog Timer Reset */
  {
      reset_info.reason = REASON_WDT_RST;
  }
  else if (1U == R_SYSTEM->RSTSR0_b.LVD0RF) /* Voltage monitor Reset */
  {
      reset_info.reason = REASON_WDT_RST;
  }
  else if (1U == R_SYSTEM->RSTSR0_b.DPSRSTF) /* Deep Software Standby Reset */
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (1U == R_SYSTEM->RSTSR1_b.SWRF) /* Software Reset */
  {
      reset_info.reason = REASON_SOFT_RESTART;
  }
  else if (1U == R_SYSTEM->RSTSR2_b.CWSF) /* Warm start */
  {
      reset_info.reason = REASON_EXT_SYS_RST;
  }

#if SOC_GPIO_RADIO_LED_TX != SOC_UNUSED_PIN
  pinMode(SOC_GPIO_RADIO_LED_TX, OUTPUT);
  digitalWrite(SOC_GPIO_RADIO_LED_TX, ! LED_STATE_ON);
#endif /* SOC_GPIO_RADIO_LED_TX */
#if SOC_GPIO_RADIO_LED_RX != SOC_UNUSED_PIN
  pinMode(SOC_GPIO_RADIO_LED_RX, OUTPUT);
  digitalWrite(SOC_GPIO_RADIO_LED_RX, ! LED_STATE_ON);
#endif /* SOC_GPIO_RADIO_LED_RX */

#if defined(NO_USB)
  Serial.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#else
  SerialOutput.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);

  for (int i=0; i < 20; i++) {if (SerialUSB) break; else delay(100);}
#endif /* NO_USB */

#if defined(ARDUINO_UNOR4_WIFI) && (__GNUC__ <= 7)
  matrix.begin();
  matrix.beginDraw();

  matrix.stroke(0xFFFFFFFF);
  matrix.textScrollSpeed(50);

  const char text[] = "   " SOFTRF_IDENT;
  matrix.textFont(Font_5x7);
  matrix.beginText(0, 1, 0xFFFFFF);
  matrix.println(text);
  matrix.endText(SCROLL_LEFT);
  matrix.endDraw();
#endif /* ARDUINO_UNOR4_WIFI */
}

static void RA4M1_post_init()
{
  {
    Serial.println();
    Serial.println(F("SoftRF Academy Edition Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf      == RF_IC_SX1276      ? F("PASS") : F("FAIL"));
    Serial.print(F("GNSS    : "));
    Serial.println(hw_info.gnss    != GNSS_MODULE_NONE  ? F("PASS") : F("FAIL"));

    Serial.println();
    Serial.println(F("External components:"));
    Serial.print(F("BARO    : "));
    Serial.println(hw_info.baro    != BARO_MODULE_NONE  ? F("PASS") : F("N/A"));
    Serial.print(F("DISPLAY : "));
    Serial.println(hw_info.display != DISPLAY_NONE      ? F("PASS") : F("N/A"));

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();
  }

  Serial.println(F("Data output device(s):"));

  Serial.print(F("NMEA   - "));
  switch (settings->nmea_out)
  {
    case NMEA_UART       :  Serial.println(F("UART"));      break;
    case NMEA_USB        :  Serial.println(F("USB CDC"));   break;
    case NMEA_UDP        :  Serial.println(F("UDP"));       break;
    case NMEA_TCP        :  Serial.println(F("TCP"));       break;
    case NMEA_BLUETOOTH  :  Serial.println(F("Bluetooth")); break;
    case NMEA_OFF        :
    default              :  Serial.println(F("NULL"));      break;
  }

