lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/RA4M1.cpp
static IPAddress AP_IP_cache = IPAddress(0, 0, 0, 0);

static IPAddress RA4M1_WiFi_get_AP_IP()
{
  if (AP_IP_cache == IPAddress(0, 0, 0, 0)) {
    AP_IP_cache = WiFi.softAPIP();
  }

  return AP_IP_cache;
}
#endif /* EXCLUDE_WIFI */

static void RA4M1_WiFi_transmit_UDP(int port, byte *buf, size_t size)
{
#if !defined(EXCLUDE_WIFI)
  IPAddress ClientIP;
  int status = WiFi.status();

  switch (status)
  {
  case WL_CONNECTED:
    ClientIP = RA4M1_WiFi_get_broadcast();
    if (Uni_Udp && ClientIP != IPAddress(0, 0, 0, 0)) {
      Uni_Udp->beginPacket(ClientIP, port);
      Uni_Udp->write(buf, size);
      Uni_Udp->endPacket();
    }
    break;
  case WL_AP_CONNECTED:
    if (SoC->WiFi_clients_count() > 0) {
      IPAddress APIP = RA4M1_WiFi_get_AP_IP();

      if (APIP != IPAddress(0, 0, 0, 0)) {
        for (int i=0; i < SoC->WiFi_clients_count(); i++) { /* TODO */
          ClientIP = IPAddress(APIP[0], APIP[1], APIP[2], APIP[3] + 1 + i); /* TODO */
          if (Uni_Udp) {
            Uni_Udp->beginPacket(ClientIP, port);
            Uni_Udp->write(buf, size);
            Uni_Udp->endPacket();
          }
        }
      }
    }
    break;
  default:
    break;
  }
#endif /* EXCLUDE_WIFI */
}

static void RA4M1_WiFiUDP_stopAll()
{
#if !defined(EXCLUDE_WIFI)
  /* TODO */
#endif /* EXCLUDE_WIFI */
}

static bool RA4M1_WiFi_hostname(String aHostname)
{
  bool rval = false;
#if !defined(EXCLUDE_WIFI)
  WiFi.setHostname(aHostname.c_str());
  rval = true;
#endif /* EXCLUDE_WIFI */
  return rval;
}

static int RA4M1_WiFi_clients_count()
{
#if !defined(EXCLUDE_WIFI)
  return  1; /* TODO */
#else
  return -1;
#endif /* EXCLUDE_WIFI */
}

static bool RA4M1_EEPROM_begin(size_t size)
{
  return true;
}

static void RA4M1_EEPROM_extension(int cmd)
{
#if defined(ARDUINO_UNOR4_WIFI) && defined(NO_USB)
  if (cmd == EEPROM_EXT_DEFAULTS) {
    settings->nmea_out = NMEA_UART;
#if defined(EXCLUDE_WIFI) && !defined(EXCLUDE_BLUETOOTH)
    settings->bluetooth = BLUETOOTH_LE_HM10_SERIAL;
#endif /* EXCLUDE_BLUETOOTH */
  }
#endif /* ARDUINO_UNOR4_WIFI */

  if (cmd == EEPROM_EXT_LOAD) {
    if (settings->mode != SOFTRF_MODE_NORMAL
#if !defined(EXCLUDE_TEST_MODE)
        &&
        settings->mode != SOFTRF_MODE_TXRX_TEST
#endif /* EXCLUDE_TEST_MODE */
        ) {
      settings->mode = SOFTRF_MODE_NORMAL;
    }

#if defined(ARDUINO_UNOR4_MINIMA)
    if (settings->nmea_out == NMEA_BLUETOOTH ||
        settings->nmea_out == NMEA_UDP       ||
        settings->nmea_out == NMEA_TCP ) {
      settings->nmea_out = NMEA_USB;
    }
    if (settings->gdl90 == GDL90_BLUETOOTH  ||
        settings->gdl90 == GDL90_UDP) {
      settings->gdl90 = GDL90_USB;
    }
    if (settings->d1090 == D1090_BLUETOOTH  ||
        settings->d1090 == D1090_UDP) {
      settings->d1090 = D1090_USB;
    }
#elif defined(ARDUINO_UNOR4_WIFI) && defined(NO_USB) && !defined(USE_RA4M1_USB)
    if (settings->nmea_out == NMEA_USB) {
      settings->nmea_out = NMEA_UART;
    }
    if (settings->gdl90 == GDL90_USB) {
      settings->gdl90 = GDL90_UART;
    }
    if (settings->d1090 == D1090_USB) {
      settings->d1090 = D1090_UART;
    }
#endif

    /* AUTO and UK RF bands are deprecated since Release v1.3 */
    if (settings->band == RF_BAND_AUTO || settings->band == RF_BAND_UK) {
      settings->band = RF_BAND_EU;
    }
  }
}

static void RA4M1_SPI_begin()
{
#if !defined(EXCLUDE_NRF905) || defined(USE_OGN_RF_DRIVER)
  SPI.begin();
#endif
}

static void RA4M1_swSer_begin(unsigned long baud)
{
  Serial_GNSS_In.begin(baud);
}

static void RA4M1_swSer_enableRx(boolean arg)
{
  /* NONE */
}

static byte RA4M1_Display_setup()
{
  byte rval = DISPLAY_NONE;

#if defined(USE_OLED)
  rval = OLED_setup();
#endif /* USE_OLED */

  return rval;
}

static void RA4M1_Display_loop()
{
#if defined(USE_OLED)
  OLED_loop();
#endif /* USE_OLED */
}

static void RA4M1_Display_fini(int reason)
{
#if defined(USE_OLED)
  OLED_fini(reason);
#endif /* USE_OLED */
}

static void RA4M1_Battery_setup()
{

}

static float RA4M1_Battery_param(uint8_t param)
{
  float rval, voltage;

  switch (param)
  {
  case BATTERY_PARAM_THRESHOLD:
    rval = hw_info.model == SOFTRF_MODEL_ACADEMY ? BATTERY_THRESHOLD_LIPO   :
                                                   BATTERY_THRESHOLD_NIMHX2;
    break;

  case BATTERY_PARAM_CUTOFF:
    rval = hw_info.model == SOFTRF_MODEL_ACADEMY ? BATTERY_CUTOFF_LIPO      :
                                                   BATTERY_CUTOFF_NIMHX2;
    break;

  case BATTERY_PARAM_CHARGE:
    voltage = Battery_voltage();
    if (voltage < Battery_cutoff())
      return 0;

    if (voltage > 4.2)
      return 100;

    if (voltage < 3.6) {
      voltage -= 3.3;
      return (voltage * 100) / 3;
    }

    voltage -= 3.6;
    rval = 10 + (voltage * 150 );
    break;

  case BATTERY_PARAM_VOLTAGE:
  default:
    {
      uint16_t mV = 0;
#if SOC_GPIO_PIN_BATTERY != SOC_UNUSED_PIN
      int adc_reading = analogRead(SOC_GPIO_PIN_BATTERY);
      mV = map(adc_reading, 0, 1023, 0, analogReference() * 1000); /* TODO */
#endif
      rval = mV / 1000.0;
    }
    break;
  }

  return rval;
}

void RA4M1_GNSS_PPS_Interrupt_handler() {
  PPS_TimeMarker = millis();
}

static unsigned long RA4M1_get_PPS_TimeMarker() {
  return PPS_TimeMarker;
}

static bool RA4M1_Baro_setup() {
  return true;
}

static void RA4M1_UATSerial_begin(unsigned long baud)
{

}

static void RA4M1_UATModule_restart()
{

}

static void RA4M1_WDT_setup()
{
  WDT.begin(5000);
  wdt_is_active = true;
}

static void RA4M1_WDT_fini()
{
  if (wdt_is_active) {
    WDT.refresh(); /* TODO */
    wdt_is_active = false;
  }
}

#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
#include <AceButton.h>
using namespace ace_button;

AceButton button_1(SOC_GPIO_PIN_BUTTON);

// The event handler for the button.
void handleEvent(AceButton* button, uint8_t eventType,
    uint8_t buttonState) {

