lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/RA4M1.cpp
  switch (eventType) {
    case AceButton::kEventClicked:
    case AceButton::kEventReleased:
#if defined(USE_OLED)
      if (button == &button_1) {
        OLED_Next_Page();
      }
#endif
      break;
    case AceButton::kEventDoubleClicked:
      break;
    case AceButton::kEventLongPressed:
      if (button == &button_1) {
        shutdown(SOFTRF_SHUTDOWN_BUTTON);
//      Serial.println(F("This will never be printed."));
      }
      break;
  }
}

/* Callbacks for push button interrupt */
void onPageButtonEvent() {
  button_1.check();
}
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */

static void RA4M1_Button_setup()
{
#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
  if (hw_info.model == SOFTRF_MODEL_ACADEMY) {
    int button_pin = SOC_GPIO_PIN_BUTTON;

    // Button(s) uses external pull up resistor.
    pinMode(button_pin, INPUT);

    button_1.init(button_pin);

    // Configure the ButtonConfig with the event handler, and enable all higher
    // level events.
    ButtonConfig* PageButtonConfig = button_1.getButtonConfig();
    PageButtonConfig->setEventHandler(handleEvent);
    PageButtonConfig->setFeature(ButtonConfig::kFeatureClick);
//    PageButtonConfig->setFeature(ButtonConfig::kFeatureDoubleClick);
    PageButtonConfig->setFeature(ButtonConfig::kFeatureLongPress);
    PageButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
//    PageButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterDoubleClick);
//    PageButtonConfig->setFeature(
//                      ButtonConfig::kFeatureSuppressClickBeforeDoubleClick);
//  PageButtonConfig->setDebounceDelay(15);
    PageButtonConfig->setClickDelay(600);
//    PageButtonConfig->setDoubleClickDelay(1500);
    PageButtonConfig->setLongPressDelay(2000);

//  attachInterrupt(digitalPinToInterrupt(button_pin), onPageButtonEvent, CHANGE );
  }
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */
}

static void RA4M1_Button_loop()
{
#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
  if (hw_info.model == SOFTRF_MODEL_ACADEMY) {
    button_1.check();
  }
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */
}

static void RA4M1_Button_fini()
{
#if SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN
  if (hw_info.model == SOFTRF_MODEL_ACADEMY) {
//  detachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_BUTTON));
    while (digitalRead(SOC_GPIO_PIN_BUTTON) == LOW);
    pinMode(SOC_GPIO_PIN_BUTTON, ANALOG);
  }
#endif /* SOC_GPIO_PIN_BUTTON != SOC_UNUSED_PIN */
}

static void RA4M1_USB_setup() {
#if defined(NO_USB)
  USBSerial.begin(SERIAL_OUT_BR);
#endif /* NO_USB */
}

static void RA4M1_USB_loop()  {

}

static void RA4M1_USB_fini()  {
#if defined(NO_USB)
  USBSerial.end();
#endif /* NO_USB */
}

static int RA4M1_USB_available()
{
  int rval = 0;

  if (USBSerial) {
    rval = USBSerial.available();
  }

  return rval;
}

static int RA4M1_USB_read()
{
  int rval = -1;

  if (USBSerial) {
    rval = USBSerial.read();
  }

  return rval;
}

static size_t RA4M1_USB_write(const uint8_t *buffer, size_t size)
{
  size_t rval = size;

  if (USBSerial && (size < USBSerial.availableForWrite())) {
    rval = USBSerial.write(buffer, size);
  }

  return rval;
}

IODev_ops_t RA4M1_USBSerial_ops = {
  "RA4M1 USBSerial",
  RA4M1_USB_setup,
  RA4M1_USB_loop,
  RA4M1_USB_fini,
  RA4M1_USB_available,
  RA4M1_USB_read,
  RA4M1_USB_write
};

#if defined(ARDUINO_UNOR4_WIFI)

static void UNOR4W_Serial_setup()     { }
static void UNOR4W_Serial_loop()      { }
static void UNOR4W_Serial_fini()      { }
static int  UNOR4W_Serial_available() { return SerialOutput.available(); }
static int  UNOR4W_Serial_read()      { return SerialOutput.read(); }

static size_t UNOR4W_Serial_write(const uint8_t *buffer, size_t size)
{
/*
        if (nl) {
          if (buf[size-1] == '\r') {
            SerialOutput.write(buf, size-1);
            SerialOutput.write((byte *) "\r\n", 2);
          } else {
            SerialOutput.write(buf, size);
            SerialOutput.write('\n');
          }
        } else {
          SerialOutput.write(buf, size);
        }
*/

  return SerialOutput.write(buffer, size);
}

IODev_ops_t UNOR4W_Serial_ops = {
  "UNOR4W Serial",
  UNOR4W_Serial_setup,
  UNOR4W_Serial_loop,
  UNOR4W_Serial_fini,
  UNOR4W_Serial_available,
  UNOR4W_Serial_read,
  UNOR4W_Serial_write
};
#endif /* ARDUINO_UNOR4_WIFI */

const SoC_ops_t RA4M1_ops = {
  SOC_RA4M1,
  "RA4M1",
  RA4M1_setup,
  RA4M1_post_init,
  RA4M1_loop,
  RA4M1_fini,
  RA4M1_reset,
  RA4M1_getChipId,
  RA4M1_getResetInfoPtr,
  RA4M1_getResetInfo,
  RA4M1_getResetReason,
  RA4M1_getFreeHeap,
  RA4M1_random,
  RA4M1_Sound_test,
  RA4M1_Sound_tone,
  NULL,
  RA4M1_WiFi_set_param,
  RA4M1_WiFi_transmit_UDP,
  RA4M1_WiFiUDP_stopAll,
  RA4M1_WiFi_hostname,
  RA4M1_WiFi_clients_count,
  RA4M1_EEPROM_begin,
  RA4M1_EEPROM_extension,
  RA4M1_SPI_begin,
  RA4M1_swSer_begin,
  RA4M1_swSer_enableRx,
#if !defined(EXCLUDE_BLUETOOTH)
  &RA4M1_Bluetooth_ops,
#else
  NULL,
#endif /* EXCLUDE_BLUETOOTH */
  &RA4M1_USBSerial_ops,
#if !defined(ARDUINO_UNOR4_WIFI)
  NULL,
#else
  &UNOR4W_Serial_ops,
#endif /* ARDUINO_UNOR4_WIFI */
  RA4M1_Display_setup,
  RA4M1_Display_loop,
  RA4M1_Display_fini,
  RA4M1_Battery_setup,
  RA4M1_Battery_param,
  RA4M1_GNSS_PPS_Interrupt_handler,
  RA4M1_get_PPS_TimeMarker,
  RA4M1_Baro_setup,
  RA4M1_UATSerial_begin,
  RA4M1_UATModule_restart,
  RA4M1_WDT_setup,
  RA4M1_WDT_fini,
  RA4M1_Button_setup,
  RA4M1_Button_loop,
  RA4M1_Button_fini,
  NULL
};

#endif /* ARDUINO_ARCH_RENESAS */
